Introductory Data Science for Innovation Studies
Seminar 2

Before we start having fun let's get the basics in place. We'll be using the California Housing data from last week so lets import all of our stuff from before (and maybe a few extra things we may not be so familiar with)

In [215]:
import pandas as pd 
import numpy as np 
from matplotlib import pyplot as plt

In [216]:
from sklearn.datasets import fetch_california_housing

Now lets load California Housing (we know this but always good to remember)

In [217]:
cal_housing = fetch_california_housing(as_frame=True)

In [218]:
type(cal_housing)

sklearn.utils.Bunch

Here comes the new stuff though. So far we haven't really looked at what we've got we just did some slightly hand-wavey visualisations but it did look a bit like magic. It doesn't really work that way though. What does this data even look like? What's its shape? How many rows and columns are there? Basics but fundamentals:

In [219]:
df = pd.DataFrame(cal_housing.data, columns = cal_housing.feature_names)

In [220]:
type(df)

pandas.core.frame.DataFrame

In [221]:
df.head()

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25

In [222]:
df.shape

(20640, 8)

In [223]:
df.columns

Index(['MedInc', 'HouseAge', 'AveRooms', 'AveBedrms', 'Population', 'AveOccup',
       'Latitude', 'Longitude'],
      dtype='object')

In [224]:
df.describe()

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude
count,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,3.870671,28.639486,5.429000,1.096675,1425.476744,3.070655,35.631861,-119.569704
std,1.899822,12.585558,2.474173,0.473911,1132.462122,10.386050,2.135952,2.003532
min,0.499900,1.000000,0.846154,0.333333,3.000000,0.692308,32.540000,-124.350000
25%,2.563400,18.000000,4.440716,1.006079,787.000000,2.429741,33.930000,-121.800000
50%,3.534800,29.000000,5.229129,1.048780,1166.000000,2.818116,34.260000,-118.490000
75%,4.743250,37.000000,6.052381,1.099526,1725.000000,3.282261,37.710000,-118.010000
max,15.000100,52.000000,141.909091,34.066667,35682.000000,1243.333333,41.950000,-114.310000

After this we may want to focus a little more on certain specific data types or sometimes our data may be a little unclean, noisy, or even have missing values. Let's look at a classic one - the titanic dataset. The notes for this dataset can be found here: https://www.openml.org/search?type=data&sort=runs&id=40945&status=active although I wasn't happy with the data so we'll download it direct from Vanderbilt

In [225]:
url = "https://biostat.app.vumc.org/wiki/pub/Main/DataSets/titanic3.csv"
titanic = pd.read_csv(url)

In [226]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

So the column names are a bit weird so we have to use the notes to workout what's going on, equally the names are all a bit messed up. We can handle some of that though. What we are most interested in is trying to understand the breakdown between different characteristics and whether they survived

In [227]:
titanic[['Last Name', 'temp']] = titanic['name'].str.split(', ', expand=True)
titanic[['Title', 'First Name']] = titanic['temp'].str.split('. ', n=1, expand=True)
titanic = titanic.drop('temp', axis=1)

In [228]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Last Name,Title,First Name
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Allen,Miss,Elisabeth Walton
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Allison,Master,Hudson Trevor
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison,Miss,Helen Loraine
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Allison,Mr,Hudson Joshua Creighton
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Allison,Mrs,Hudson J C (Bessie Waldo Daniels)

In [229]:
print(titanic.groupby(['pclass', 'sex']).describe())

              survived                                                 age  \
                 count      mean       std  min  25%  50%  75%  max  count
pclass sex
1      female    144.0  0.965278  0.183714  0.0  1.0  1.0  1.0  1.0  133.0
       male      179.0  0.340782  0.475302  0.0  0.0  0.0  1.0  1.0  151.0
2      female    106.0  0.886792  0.318352  0.0  1.0  1.0  1.0  1.0  103.0
       male      171.0  0.146199  0.354343  0.0  0.0  0.0  0.0  1.0  158.0
3      female    216.0  0.490741  0.501076  0.0  0.0  0.0  1.0  1.0  152.0
       male      493.0  0.152130  0.359511  0.0  0.0  0.0  0.0  1.0  349.0

                          ...        fare            body              \
                    mean  ...         75%       max count        mean
pclass sex                ...
1      female  37.037594  ...  135.919775  512.3292   0.0         NaN
       male    41.029272  ...   79.200000  512.3292  35.0  162.828571
2      female  27.499223  ...   26.250000   65.0000   1.0   52.000000
       male    30.815380  ...   26.000000   73.5000  30.0  171.233333
3      female  22.185329  ...   17.850000   69.5500   7.0  183.000000
       male    25.962264  ...    9.586450   69.5500  48.0  151.854167


                      std   min     25%    50%     75%    max
pclass sex
1      female         NaN   NaN     NaN    NaN     NaN    NaN
       male     82.652172  16.0  109.50  166.0  233.00  307.0
2      female         NaN  52.0   52.00   52.0   52.00   52.0
       male    106.708007  15.0   85.00  160.0  285.25  322.0
3      female  140.538251   7.0   57.00  206.0  313.00  328.0
       male     96.957984   1.0   68.75  148.0  214.50  314.0

[6 rows x 48 columns]

Now try to calculate the survival rate based on sex/gender and travel class!

In [230]:
print(titanic.groupby(['sex', 'pclass', 'survived']).size())
groups = titanic.groupby(['sex', 'pclass', 'survived']).count
#groups.reset_index()

sex     pclass  survived
female  1       0             5
                1           139
        2       0            12
                1            94
        3       0           110
                1           106
male    1       0           118
                1            61
        2       0           146
                1            25
        3       0           418
                1            75
dtype: int64

In [231]:
def percentage(part, whole):
  return 100 * float(part)/float(whole)
  
groups['percentage'] = 100 * groups['survived'] / groups['survived'].sum()

TypeError: 'method' object is not subscriptable